app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post1"], ["description", "des1"], ["created_at", "2020-04-15 22:01:40.696221"], ["updated_at", "2020-04-15 22:01:40.696221"]]
---
	def create
	  @post = Post.new(post_params)
	  @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "description"], ["updated_at", "2020-04-15 22:02:11.694550"], ["id", 2]]
---
	def update
	  @post = Post.find(params[:id])
	  @post.update(params.require(:post).permit(:title, :description))